Repository: sadewnethsara/edu_app
Catalog: lib/l10n/app_*.arb
Languages: si

source: Choose Your App Language
si: ඔබගේ යෙදුම් භාෂාව තෝරන්න

# languagePageSubtitle
source: Select your preferred language for the app interface and content.
si: යෙදුම් අතුරුමුහුණත සහ අන්තර්ගතය සඳහා ඔබ කැමති භාෂාව තෝරන්න.

# pleaseSelectLanguage
source: Please select an app language to continue.
si: ඉදිරියට යාමට කරුණාකර යෙදුම් භාෂාවක් තෝරන්න.

source: Settings
si: සැකසුම්

source: Account Settings
si: ගිණුම් සැකසුම්

source: Learning Preferences
si: ඉගෙනීමේ අභිරුචි

source: Personal Information
si: පුද්ගලික තොරතුරු

source: Save All Changes
si: සියලු වෙනස්කම් සුරකින්න

source: App Language
si: යෙදුම් භාෂාව

source: Select App Language
si: යෙදුම් භාෂාව තෝරන්න

source: Learning Medium
si: ඉගෙනීමේ මාධ්‍යය

source: Select Learning Medium
si: ඉගෙනීමේ මාධ්‍යය තෝරන්න

source: Your Grades
si: ඔබේ පන්ති

source: No grades available
si: පන්ති නොමැත

source: Settings saved successfully!
si: සැකසුම් සාර්ථකව සුරකින ලදී!

source: Failed to save settings
si: සැකසුම් සුරැකීමට අසමත් විය

source: Cancel
si: අවලංගු කරන්න

source: Full Name
si: සම්පූර්ණ නම

source: Province
si: පළාත

source: District
si: දිස්ත්‍රික්කය

source: City
si: නගරය

source: Gender
si: ස්ත්‍රී පුරුෂ භාවය

source: Not set
si: සකසා නැත

source: No Name
si: නමක් නැත

source: No Email
si: ඊමේල් නැත

source: Loading...
si: පූරණය වෙමින්...

source: Save
si: සුරකින්න

source: Close
si: වසන්න

source: Done
si: අවසන්

source: Next
si: ඊළඟ

source: Previous
si: පෙර

source: Finish
si: නිමකරන්න

# continueButton
source: Continue
si: ඉදිරියට යන්න

source: Skip
si: මඟහරින්න

source: OK
si: හරි

source: Yes
si: ඔව්

source: No
si: නැහැ

source: Error
si: දෝෂයක්

source: Success
si: සාර්ථකයි

source: Retry
si: නැවත උත්සාහ කරන්න

source: Refresh
si: නැවුම් කරන්න

source: Home
si: මුල් පිටුව

source: Subjects
si: විෂයයන්

source: Lessons
si: පාඩම්

source: Past Papers
si: පසුගිය ප්‍රශ්න පත්‍ර

source: Leaderboard
si: ප්‍රමුඛ පුවරුව

source: Profile
si: පැතිකඩ

source: Welcome
si: සාදරයෙන් පිළිගනිමු

source: Sign In
si: පුරනය වන්න

source: Sign Out
si: ඉවත්වන්න

source: Sign Up
si: ලියාපදිංචි වන්න

source: Login
si: පුරනය වන්න

source: Logout
si: ඉවත්වන්න

source: Email
si: ඊමේල්

source: Password
si: මුරපදය

source: Forgot Password?
si: මුරපදය අමතක ද?

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Sign In with Google
si: Google සමඟ පුරනය වන්න

source: Sign In with Email
si: ඊමේල් සමඟ පුරනය වන්න

source: Welcome Back
si: නැවත සාදරයෙන් පිළිගනිමු

source: Your Learning Journey
si: ඔබේ ඉගෙනීමේ ගමන

# continueWhere
source: Continue where you left off
si: ඔබ නතර කළ තැනින් දිගටම

source: Explore Subjects
si: විෂයයන් ගවේෂණය කරන්න

source: Recent Activity
si: මෑත ක්‍රියාකාරකම්

source: No recent activity
si: මෑත ක්‍රියාකාරකම් නොමැත

source: Daily Streak
si: දෛනික කඩදාසි

source: days streak
si: දින කඩදාසි

source: Keep it up!
si: එය දිගටම කරගෙන යන්න!

source: All Subjects
si: සියලුම විෂයයන්

source: No subjects available
si: විෂයයන් නොමැත

# selectSubject
source: Select a subject to start learning
si: ඉගෙනීම ආරම්භ කිරීමට විෂයයක් තෝරන්න

source: Mathematics
si: ගණිතය

source: Science
si: විද්‍යාව

source: Language
si: භාෂාව

source: All Lessons
si: සියලුම පාඩම්

source: No lessons available
si: පාඩම් නොමැත

source: Lesson Content
si: පාඩම් අන්තර්ගතය

source: Start Lesson
si: පාඩම ආරම්භ කරන්න

source: Continue Lesson
si: පාඩම දිගටම කරන්න

source: Completed Lessons
si: සම්පූර්ණ කළ පාඩම්

source: In Progress
si: ක්‍රියාත්මක

source: Not Started
si: ආරම්භ කර නැත

source: Locked
si: අගුළු දමා ඇත

source: Unlocked
si: අගුළු ඇරියා

source: Subtopics
si: උප මාතෘකා

source: No subtopics available
si: උප මාතෘකා නොමැත

source: Videos
si: වීඩියෝ

source: Notes
si: සටහන්

source: PDFs
si: PDF

source: Resources
si: සම්පත්

source: No videos available
si: වීඩියෝ නොමැත

source: No notes available
si: සටහන් නොමැත

source: No PDFs available
si: PDF නොමැත

source: No resources available
si: සම්පත් නොමැත

source: Play Video
si: වීඩියෝව වයන්න

source: Open Note
si: සටහන විවෘත කරන්න

source: Open PDF
si: PDF විවෘත කරන්න

source: Open in External App
si: බාහිර යෙදුමකින් විවෘත කරන්න

source: Download
si: බාගත කරන්න

source: Video Player
si: වීඩියෝ වාදකය

source: Up Next
si: ඊළඟට

# downloadFeatureNotImplemented
source: Download feature not yet implemented.
si: බාගත කිරීමේ විශේෂාංගය තවම ක්‍රියාත්මක කර නොමැත.

source: Search Past Papers
si: පසුගිය ප්‍රශ්න පත්‍ර සොයන්න

source: No past papers available
si: පසුගිය ප්‍රශ්න පත්‍ර නොමැත

source: Filter by Year
si: වසර අනුව පෙරහන් කරන්න

source: Filter by Subject
si: විෂයය අනුව පෙරහන් කරන්න

source: Filter by Grade
si: පන්තිය අනුව පෙරහන් කරන්න

source: All Years
si: සියලුම වසර

source: Year
si: වර්ෂය

source: Term
si: වාරය

source: View Paper
si: ප්‍රශ්න පත්‍රය බලන්න

source: View Answers
si: පිළිතුරු බලන්න

source: Answers
si: පිළිතුරු

source: My Profile
si: මගේ පැතිකඩ

source: Edit Profile
si: පැතිකඩ සංස්කරණය කරන්න

# accountInfo
source: Account Information
si: ගිණුම් තොරතුරු

source: Preferences
si: අභිරුචි

source: Statistics
si: සංඛ්‍යාලේඛන

source: Achievements
si: ජයග්‍රහණ

# noAchievements
source: No achievements yet
si: තවම ජයග්‍රහණ නොමැත

source: Top Performers
si: ඉහළ කාර්ය සාධකයින්

source: Your Rank
si: ඔබේ ශ්‍රේණිය

source: Points
si: ලකුණු

source: Rank
si: ශ්‍රේණිය

# noLeaderboardData
source: No leaderboard data available
si: ප්‍රමුඛ පුවරු දත්ත නොමැත

source: Change Theme
si: තේමාව වෙනස් කරන්න

source: Light Mode
si: ආලෝක ප්‍රකාරය

source: Dark Mode
si: අඳුරු ප්‍රකාරය

source: System Default
si: පද්ධති පෙරනිමි

source: Pull to refresh
si: නැවුම් කිරීමට අදින්න

source: Refreshing...
si: නැවුම් වෙමින්...

source: Grades
si: පන්ති

source: Select Your Grades
si: ඔබේ පන්ති තෝරන්න

source: Grade
si: පන්තිය

source: English
si: ඉංග්‍රීසි

source: Sinhala
si: සිංහල

source: Tamil
si: දෙමළ

source: Something went wrong
si: යමක් වැරදී ඇත

# tryAgainLater
source: Please try again later
si: කරුණාකර පසුව නැවත උත්සාහ කරන්න

source: No internet connection
si: අන්තර්ජාල සම්බන්ධතාවයක් නැත

# checkConnection
source: Please check your connection
si: කරුණාකර ඔබේ සම්බන්ධතාවය පරීක්ෂා කරන්න

source: Failed to load
si: පූරණය කිරීමට අසමත් විය

source: Error loading data
si: දත්ත පූරණය කිරීමේ දෝෂයකි

# errorOccurred
source: An error occurred
si: දෝෂයක් සිදුවිය

source: No data available
si: දත්ත නොමැත

# nothingToShow
source: Nothing to show here
si: මෙහි පෙන්වීමට කිසිවක් නැත

# comeBackLater
source: Come back later for updates
si: යාවත්කාලීන සඳහා පසුව නැවත පැමිණෙන්න

source: Start exploring!
si: ගවේෂණය ආරම්භ කරන්න!

source: Error: Could not load video.
si: දෝෂයක්: වීඩියෝව පූරණය කිරීමට නොහැකි විය.

source: Video could not be played
si: වීඩියෝව වාදනය කළ නොහැක

source: Untitled Video
si: මාතෘකා රහිත වීඩියෝව

# downloadVideoTooltip
source: Download Video
si: වීඩියෝව බාගත කරන්න

source: PDF Document
si: PDF ලේඛනය

# failedToLoadPdf
source: Failed to load PDF. Please try again.
si: PDF පූරණය කිරීමට අසමත් විය. කරුණාකර නැවත උත්සාහ කරන්න.

source: Mark as Completed
si: සම්පූර්ණ ලෙස සලකුණු කරන්න

# markedAsCompleted
source: {name} marked as completed.
si: {name} සම්පූර්ණ ලෙස සලකුණු කරන ලදී.

# failedToLoadContent
source: Failed to load content. Please try again.
si: අන්තර්ගතය පූරණය කිරීමට අසමත් විය. කරුණාකර නැවත උත්සාහ කරන්න.

# streakDialog
source: Streak
si: කඩදාසි

source: Congratulations!
si: සුභ පැතුම්!

# keepLearning
source: Keep learning every day!
si: සෑම දිනකම ඉගෙනීම දිගටම කරගෙන යන්න!

source: All Your Lessons
si: ඔබේ සියලුම පාඩම්

# organizedByGrade
source: Organized by grade and subject
si: පන්තිය සහ විෂයය අනුව සංවිධානය කර ඇත

# tapToExpand
source: Tap to expand and view lessons
si: පාඩම් දැකීමට පුළුල් කිරීමට තට්ටු කරන්න

source: No content available
si: අන්තර්ගතයක් නොමැත
